extension/src/DataProcessors/мкпАдминистрированиеКоннектора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>мкпАдминистрированиеКоннектора</Name>
			<Comment>Генерация токена клиента, чеклист публикации, самодиагностика. Ключ продукта не требуется.</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

extension/src/Catalogs/мкпКлиентыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>мкпКлиентыИнтеграции</Name>
			<Comment>Приложения и агенты: хеш токена, скоупы, сопоставленный пользователь 1С.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХешТокена</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>64</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скоупы</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>500</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>100</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитСуммы</Name>
					<Comment>0 — без ограничения. Проверяется на dry-run и записи.</Comment>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитКоличества</Name>
					<Comment>0 — без ограничения. Сумма Quantity/Количество и строк табличных частей.</Comment>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>3</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

extension/src/DataProcessors/мкпАдминистрированиеКоннектора/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Создаёт клиента интеграции. Plaintext токена возвращается один раз; в справочник пишется SHA-256.
//
// Параметры:
//  Наименование - Строка
//  Скоупы - Строка - например "read" или "read,write"
//  ПользовательИБ - Строка
//
// Возвращаемое значение:
//  Структура - Токен, ХешТокена, Ссылка
//
Функция СгенерироватьТокенКлиента(Наименование, Скоупы, ПользовательИБ = "") Экспорт

	Токен = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "")
		+ СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	Хеш = мкпСериализация.ХешТокена(Токен);

	Элемент = Справочники.мкпКлиентыИнтеграции.СоздатьЭлемент();
	Элемент.Наименование = Наименование;
	Элемент.ХешТокена = Хеш;
	Элемент.Скоупы = Скоупы;
	Элемент.ПользовательИБ = ПользовательИБ;
	Элемент.Активен = Истина;
	Элемент.Записать();

	Результат = Новый Структура;
	Результат.Вставить("Токен", Токен);
	Результат.Вставить("ХешТокена", Хеш);
	Результат.Вставить("Ссылка", Элемент.Ссылка);
	Возврат Результат;

КонецФункции

// Чеклист публикации HTTP-сервиса. Это инструкция и самопроверка, не кликер IIS.
//
// Возвращаемое значение:
//  Массив из Структура - id, ok, detail
//
Функция ЧеклистПубликации() Экспорт

	Проверки = Новый Массив;
	Проверки.Добавить(ПунктЧеклиста("root_url", Истина, "HTTP-сервис мкпAPI, RootURL mcp"));
	Проверки.Добавить(ПунктЧеклиста("reuse_sessions", Истина, "ReuseSessions=AutoUse, SessionMaxAge=20"));
	Проверки.Добавить(ПунктЧеклиста("role", Истина, "Роль мкпДоступКоннектора у пользователя публикации"));
	Проверки.Добавить(ПунктЧеклиста("http_services", Истина, "Публикация на веб-сервере с HTTP-сервисами"));
	Проверки.Добавить(ПунктЧеклиста("not_public", Истина, "1С не опубликована в интернет: только шлюз"));
	Проверки.Добавить(ПунктЧеклиста("product_license", Истина, "not_required"));
	Возврат Проверки;

КонецФункции

// Самодиагностика контура адаптера. Совпадает по смыслу с GET /v1/diag.
//
// Возвращаемое значение:
//  Структура
//
Функция Самодиагностика() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("status", "ok");
	Результат.Вставить("service", "1cmcp");
	Результат.Вставить("version", мкпСериализация.ВерсияРасширения());
	Результат.Вставить("api", "v1");
	Результат.Вставить("product_license", "not_required");

	Совместимость = Новый Структура;
	Совместимость.Вставить("platform", "8.3.20+");
	Режимы = Новый Массив;
	Режимы.Добавить("file");
	Режимы.Добавить("client_server");
	Совместимость.Вставить("modes", Режимы);
	Результат.Вставить("compatibility", Совместимость);

	Публикация = Новый Структура;
	Публикация.Вставить("root_url", "mcp");
	Публикация.Вставить("reuse_sessions", "AutoUse");
	Публикация.Вставить("session_max_age", 20);
	Результат.Вставить("publication", Публикация);
	Результат.Вставить("checks", ЧеклистПубликации());

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПунктЧеклиста(Идентификатор, Успех, Подробность)

	Пункт = Новый Структура;
	Пункт.Вставить("id", Идентификатор);
	Пункт.Вставить("ok", Успех);
	Пункт.Вставить("detail", Подробность);
	Возврат Пункт;

КонецФункции

#КонецОбласти
